//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CBaseViewModel.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CBaseViewModel
	{
	public:
		bool   	m_flPoseParameter[1]; // 0x0
		unsigned char _0x0[0x78];
		int    	m_fEffects; // 0x78
		unsigned char _0x7c[0x10];
		int    	m_nModelIndex; // 0x8c
		unsigned char _0x90[0x1300];
		int    	m_nSkin; // 0x1390
		int    	m_nBody; // 0x1394
		unsigned char _0x1398[0x20];
		float  	m_flPlaybackRate; // 0x13b8
		unsigned char _0x13bc[0xd8];
		float  	m_flPoseParameter_0; // 0x1494
		unsigned char _0x1498[0x16c];
		int    	m_nNewSequenceParity; // 0x1604
		int    	m_nResetEventsParity; // 0x1608
		unsigned char _0x160c[0x24];
		int    	m_nSequence; // 0x1630
		unsigned char _0x1634[0x8c];
		int    	m_nMuzzleFlashParity; // 0x16c0
		unsigned char _0x16c4[0x10c];
		int    	m_nViewModelIndex; // 0x17d0
		int    	m_hOwner; // 0x17d4
		unsigned char _0x17d8[0x8];
		int    	m_nAnimationParity; // 0x17e0
		unsigned char _0x17e4[0xc];
		int    	m_hWeapon; // 0x17f0
	};
#pragma pack(pop)
