//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CBeam.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CBeam
	{
	public:
		unsigned char _0x0[0x54];
		int    	m_nRenderFX; // 0x54
		int    	m_clrRender; // 0x58
		unsigned char _0x5c[0x20];
		int    	m_nRenderMode; // 0x7c
		unsigned char _0x80[0xc];
		int    	m_nModelIndex; // 0x8c
		unsigned char _0x90[0x10];
		int    	m_PredictableID; // 0xa0
		unsigned char _0xa4[0xec];
		int    	moveparent; // 0x190
		unsigned char _0x194[0x1a4];
		vector3	m_vecOrigin; // 0x338
		unsigned char _0x344[0x184];
		int    	m_bIsPlayerSimulated; // 0x4c8
		unsigned char _0x4cc[0xebc];
		float  	m_flFrameRate; // 0x1388
		float  	m_flHDRColorScale; // 0x138c
		unsigned char _0x1390[0x8];
		int    	m_nNumBeamEnts; // 0x1398
		unsigned char _0x139c[0x4];
		int    	m_nHaloIndex; // 0x13a0
		int    	m_nBeamType; // 0x13a4
		int    	m_nBeamFlags; // 0x13a8
		int    	m_hAttachEntity[10]; // 0x13ac
		int    	m_nAttachIndex[10]; // 0x13d4
		float  	m_fWidth; // 0x13fc
		float  	m_fEndWidth; // 0x1400
		float  	m_fFadeLength; // 0x1404
		float  	m_fHaloScale; // 0x1408
		float  	m_fAmplitude; // 0x140c
		float  	m_fStartFrame; // 0x1410
		float  	m_fSpeed; // 0x1414
		int    	m_nMinDXLevel; // 0x1418
		float  	m_flFrame; // 0x141c
		vector3	m_vecEndPos; // 0x1420
	};
#pragma pack(pop)
