//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CCFish.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CCFish
	{
	public:
		unsigned char _0x0[0x8c];
		int    	m_nModelIndex; // 0x8c
		int    	m_lifeState; // 0x8f
		unsigned char _0x93[0x1771];
		float  	m_x; // 0x1804
		float  	m_y; // 0x1808
		float  	m_z; // 0x180c
		unsigned char _0x1810[0x4];
		float  	m_angle; // 0x1814
		unsigned char _0x1818[0x4];
		vector3	m_poolOrigin; // 0x181c
		float  	m_waterLevel; // 0x1828
	};
#pragma pack(pop)
