//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CCollisionProperty.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CCollisionProperty
	{
	public:
		unsigned char _0x0[0x8];
		vector3	m_vecMinsPreScaled; // 0x8
		vector3	m_vecMaxsPreScaled; // 0x14
		vector3	m_vecMins; // 0x20
		vector3	m_vecMaxs; // 0x2c
		unsigned char _0x38[0x4];
		int    	m_usSolidFlags; // 0x3c
		int    	m_nSurroundType; // 0x40
		int    	m_nSolidType; // 0x41
		int    	m_triggerBloat; // 0x42
		vector3	m_vecSpecifiedSurroundingMinsPreScaled; // 0x44
		vector3	m_vecSpecifiedSurroundingMaxsPreScaled; // 0x50
		vector3	m_vecSpecifiedSurroundingMins; // 0x5c
		vector3	m_vecSpecifiedSurroundingMaxs; // 0x68
	};
#pragma pack(pop)
