//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CEffectData.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CEffectData
	{
	public:
		float  	m_vOrigin_0; // 0x0
		float  	m_vOrigin_1; // 0x4
		float  	m_vOrigin_2; // 0x8
		float  	m_vStart_0; // 0xc
		float  	m_vStart_1; // 0x10
		float  	m_vStart_2; // 0x14
		vector3	m_vNormal; // 0x18
		vector3	m_vAngles; // 0x24
		int    	m_fFlags; // 0x30
		unsigned char _0x34[0x4];
		float  	m_flScale; // 0x38
		float  	m_flMagnitude; // 0x3c
		float  	m_flRadius; // 0x40
		int    	m_nAttachmentIndex; // 0x44
		int    	m_nSurfaceProp; // 0x48
		int    	m_nMaterial; // 0x4c
		int    	m_nDamageType; // 0x50
		int    	m_nHitBox; // 0x54
		int    	m_nColor; // 0x58
		int    	m_bCustomColors; // 0x59
		vector3	m_CustomColors_m_vecColor1; // 0x5c
		vector3	m_CustomColors_m_vecColor2; // 0x68
		int    	m_bControlPoint1; // 0x74
		int    	m_ControlPoint1_m_eParticleAttachment; // 0x78
		float  	m_ControlPoint1_m_vecOffset_0; // 0x7c
		float  	m_ControlPoint1_m_vecOffset_1; // 0x80
		float  	m_ControlPoint1_m_vecOffset_2; // 0x84
		int    	m_bAllowOverride; // 0x88
		int    	m_iEffectName; // 0x8c
	};
#pragma pack(pop)
