//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CEnvWindShared.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CEnvWindShared
	{
	public:
		unsigned char _0x0[0x4];
		float  	m_flStartTime; // 0x4
		int    	m_iWindSeed; // 0x8
		int    	m_iMinWind; // 0xc
		int    	m_iMaxWind; // 0x10
		int    	m_iMinGust; // 0x14
		int    	m_iMaxGust; // 0x18
		float  	m_flMinGustDelay; // 0x1c
		float  	m_flMaxGustDelay; // 0x20
		float  	m_flGustDuration; // 0x24
		int    	m_iGustDirChange; // 0x28
		unsigned char _0x2c[0xc];
		int    	m_iInitialWindDir; // 0x38
		float  	m_flInitialWindSpeed; // 0x3c
	};
#pragma pack(pop)
