//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CFogController.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CFogController
	{
	public:
		unsigned char _0x0[0x138c];
		vector3	m_fog_dirPrimary; // 0x138c
		int    	m_fog_colorPrimary; // 0x1398
		int    	m_fog_colorSecondary; // 0x139c
		int    	m_fog_colorPrimaryLerpTo; // 0x13a0
		int    	m_fog_colorSecondaryLerpTo; // 0x13a4
		float  	m_fog_start; // 0x13a8
		float  	m_fog_end; // 0x13ac
		float  	m_fog_farz; // 0x13b0
		float  	m_fog_maxdensity; // 0x13b4
		float  	m_fog_startLerpTo; // 0x13b8
		float  	m_fog_endLerpTo; // 0x13bc
		float  	m_fog_lerptime; // 0x13c0
		float  	m_fog_duration; // 0x13c4
		int    	m_fog_enable; // 0x13c8
		int    	m_fog_blend; // 0x13c9
	};
#pragma pack(pop)
