//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CFunc_Dust.h
//***********************************************

#pragma once

#include "CCollisionProperty.h"

#pragma pack(push,1)
	class CFunc_Dust
	{
	public:
		unsigned char _0x0[0x8c];
		int    	m_nModelIndex; // 0x8c
		unsigned char _0x90[0x10c];
		CCollisionProperty	m_Collision; // 0x19c
		unsigned char _0x210[0x1178];
		int    	m_Color; // 0x1388
		int    	m_SpawnRate; // 0x138c
		float  	m_flSizeMin; // 0x1390
		float  	m_flSizeMax; // 0x1394
		int    	m_SpeedMax; // 0x1398
		int    	m_LifetimeMin; // 0x139c
		int    	m_LifetimeMax; // 0x13a0
		int    	m_DistMax; // 0x13a4
		float  	m_FallSpeed; // 0x13a8
		int    	m_DustFlags; // 0x13ac
	};
#pragma pack(pop)
