//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CHL2Local.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CHL2Local
	{
	public:
		unsigned char _0x0[0x4];
		float  	m_flSuitPower; // 0x4
		int    	m_bZooming; // 0x8
		int    	m_bitsActiveDevices; // 0xc
		int    	m_iSquadMemberCount; // 0x10
		int    	m_iSquadMedicCount; // 0x14
		int    	m_fSquadInFollowMode; // 0x18
		int    	m_bWeaponLowered; // 0x19
		int    	m_hAutoAimTarget; // 0x1c
		vector3	m_vecAutoAimPoint; // 0x20
		int    	m_bDisplayReticle; // 0x2c
		int    	m_bStickyAutoAim; // 0x2d
		int    	m_bAutoAimTarget; // 0x2e
		int    	m_hLadder; // 0x30
	};
#pragma pack(pop)
