//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CLightGlow.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CLightGlow
	{
	public:
		float  	HDRColorScale; // 0x0
		unsigned char _0x4[0x54];
		int    	m_clrRender; // 0x58
		unsigned char _0x5c[0x134];
		int    	moveparent; // 0x190
		unsigned char _0x194[0x1a4];
		vector3	m_vecOrigin; // 0x338
		vector3	m_angRotation; // 0x344
		unsigned char _0x350[0x1038];
		int    	m_nHorizontalSize; // 0x1388
		int    	m_nVerticalSize; // 0x138c
		int    	m_nMinDist; // 0x1390
		int    	m_nMaxDist; // 0x1394
		int    	m_nOuterMaxDist; // 0x1398
		int    	m_spawnflags; // 0x139c
		unsigned char _0x13a0[0xcc];
		float  	m_flGlowProxySize; // 0x146c
	};
#pragma pack(pop)
