//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CLocalPlayerExclusive.h
//***********************************************

#pragma once

#include "CLocal.h"

#pragma pack(push,1)
	class CLocalPlayerExclusive
	{
	public:
		unsigned char _0x0[0x84];
		int    	m_nNextThinkTick; // 0x84
		unsigned char _0x88[0x60];
		float  	m_vecViewOffset_0; // 0xe8
		float  	m_vecViewOffset_1; // 0xec
		float  	m_vecViewOffset_2; // 0xf0
		float  	m_vecVelocity_0; // 0xf4
		float  	m_vecVelocity_1; // 0xf8
		float  	m_vecVelocity_2; // 0xfc
		unsigned char _0x100[0x58];
		vector3	m_vecBaseVelocity; // 0x158
		unsigned char _0x164[0xf0];
		int    	m_hGroundEntity; // 0x254
		unsigned char _0x258[0x4];
		float  	m_flFriction; // 0x25c
		unsigned char _0x260[0x19a8];
		int    	m_iAmmo[128]; // 0x1c08
		unsigned char _0x1e08[0x454];
		CLocal	m_Local; // 0x225c
		unsigned char _0x2454[0x28];
		int    	m_fOnTarget; // 0x247c
		unsigned char _0x2480[0x34];
		int    	m_hConstraintEntity; // 0x24b4
		vector3	m_vecConstraintCenter; // 0x24b8
		float  	m_flConstraintRadius; // 0x24c4
		float  	m_flConstraintWidth; // 0x24c8
		float  	m_flConstraintSpeedFactor; // 0x24cc
		unsigned char _0x24d0[0x24];
		float  	m_flDeathTime; // 0x24f4
		unsigned char _0x24f8[0x88];
		int    	m_nTickBase; // 0x2580
		unsigned char _0x2584[0x14];
		int    	m_hLastWeapon; // 0x2598
		unsigned char _0x259c[0x3c0];
		float  	m_flLaggedMovementValue; // 0x295c
		unsigned char _0x2960[0x1cc];
		int    	m_hViewEntity; // 0x2b2c
	};
#pragma pack(pop)
