//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CLocal.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CLocal
	{
	public:
		unsigned char _0x0[0x4];
		bool   	m_chAreaBits[32]; // 0x4
		bool   	m_chAreaPortalBits[24]; // 0x24
		int    	m_iHideHUD; // 0x3c
		float  	m_flFOVRate; // 0x40
		int    	m_bDucked; // 0x44
		int    	m_bDucking; // 0x45
		int    	m_bInDuckJump; // 0x46
		float  	m_flDucktime; // 0x48
		float  	m_flDuckJumpTime; // 0x4c
		float  	m_flJumpTime; // 0x50
		unsigned char _0x54[0x4];
		float  	m_flFallVelocity; // 0x58
		unsigned char _0x5c[0x10];
		vector3	m_vecPunchAngle; // 0x6c
		unsigned char _0x78[0x30];
		vector3	m_vecPunchAngleVel; // 0xa8
		unsigned char _0xb4[0x30];
		int    	m_bDrawViewmodel; // 0xe4
		int    	m_bWearingSuit; // 0xe5
		int    	m_bPoisoned; // 0xe6
		float  	m_flStepSize; // 0xe8
		int    	m_bAllowAutoMovement; // 0xec
		unsigned char _0xf0[0x4];
		int    	m_skybox3d_scale; // 0xf4
		vector3	m_skybox3d_origin; // 0xf8
		int    	m_skybox3d_area; // 0x104
		unsigned char _0x108[0x4];
		vector3	m_skybox3d_fog_dirPrimary; // 0x10c
		int    	m_skybox3d_fog_colorPrimary; // 0x118
		int    	m_skybox3d_fog_colorSecondary; // 0x11c
		unsigned char _0x120[0x8];
		float  	m_skybox3d_fog_start; // 0x128
		float  	m_skybox3d_fog_end; // 0x12c
		unsigned char _0x130[0x4];
		float  	m_skybox3d_fog_maxdensity; // 0x134
		unsigned char _0x138[0x10];
		int    	m_skybox3d_fog_enable; // 0x148
		int    	m_skybox3d_fog_blend; // 0x149
		unsigned char _0x14d[0x3];
		int    	m_PlayerFog_m_hCtrl; // 0x150
		unsigned char _0x154[0x20];
		vector3	m_audio_localSound_0; // 0x174
		vector3	m_audio_localSound_1; // 0x180
		vector3	m_audio_localSound_2; // 0x18c
		vector3	m_audio_localSound_3; // 0x198
		vector3	m_audio_localSound_4; // 0x1a4
		vector3	m_audio_localSound_5; // 0x1b0
		vector3	m_audio_localSound_6; // 0x1bc
		vector3	m_audio_localSound_7; // 0x1c8
		int    	m_audio_soundscapeIndex; // 0x1d4
		int    	m_audio_localBits; // 0x1d8
		int    	m_audio_ent; // 0x1dc
		unsigned char _0x1e0[0x4];
		float  	m_fSprintSpeed; // 0x1e4
		float  	m_fWalkSpeed; // 0x1e8
		float  	m_fCrouchedWalkSpeed; // 0x1ec
		float  	m_fDuckSpeed; // 0x1f0
		float  	m_fUnDuckSpeed; // 0x1f4
	};
#pragma pack(pop)
