//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CParticleSystem.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CParticleSystem
	{
	public:
		unsigned char _0x0[0x17a];
		int    	m_iParentAttachment; // 0x17a
		unsigned char _0x17e[0x12];
		int    	moveparent; // 0x190
		unsigned char _0x194[0x1a4];
		vector3	m_vecOrigin; // 0x338
		vector3	m_angRotation; // 0x344
		unsigned char _0x350[0x188];
		int    	m_hOwnerEntity; // 0x4d8
		unsigned char _0x4dc[0xeac];
		int    	m_iEffectIndex; // 0x1388
		int    	m_bActive; // 0x138c
		float  	m_flStartTime; // 0x1390
		int    	m_hControlPointEnts[63]; // 0x1394
		bool   	m_iControlPointParents[63]; // 0x1490
		int    	m_bWeatherEffect; // 0x14cf
	};
#pragma pack(pop)
