//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CPlayerResource.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CPlayerResource
	{
	public:
		unsigned char _0x0[0x1590];
		int    	m_iPing[129]; // 0x1590
		int    	m_iScore[129]; // 0x1794
		int    	m_iDeaths[129]; // 0x1998
		bool   	m_bConnected[129]; // 0x1b9c
		unsigned char _0x1c1d[0x3];
		int    	m_iTeam[129]; // 0x1c20
		bool   	m_bAlive[129]; // 0x1e24
		unsigned char _0x1ea5[0x3];
		int    	m_iHealth[129]; // 0x1ea8
		int    	m_iArmor[129]; // 0x20ac
	};
#pragma pack(pop)
