//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CPropVehicleChoreoGeneric.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CPropVehicleChoreoGeneric
	{
	public:
		unsigned char _0x0[0x17e4];
		int    	m_hPlayer; // 0x17e4
		unsigned char _0x17e8[0x4];
		int    	m_bEnterAnimOn; // 0x17ec
		int    	m_bExitAnimOn; // 0x17ed
		vector3	m_vecEyeExitEndpoint; // 0x17f0
		unsigned char _0x17fc[0x80];
		int    	m_vehicleView_bClampEyeAngles; // 0x187c
		float  	m_vehicleView_flPitchCurveZero; // 0x1880
		float  	m_vehicleView_flPitchCurveLinear; // 0x1884
		float  	m_vehicleView_flRollCurveZero; // 0x1888
		float  	m_vehicleView_flRollCurveLinear; // 0x188c
		float  	m_vehicleView_flFOV; // 0x1890
		float  	m_vehicleView_flYawMin; // 0x1894
		float  	m_vehicleView_flYawMax; // 0x1898
		float  	m_vehicleView_flPitchMin; // 0x189c
		float  	m_vehicleView_flPitchMax; // 0x18a0
	};
#pragma pack(pop)
