//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CRopeKeyframe.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CRopeKeyframe
	{
	public:
		unsigned char _0x0[0x17a];
		int    	m_iParentAttachment; // 0x17a
		unsigned char _0x17e[0x12];
		int    	moveparent; // 0x190
		unsigned char _0x194[0x1a4];
		vector3	m_vecOrigin; // 0x338
		unsigned char _0x344[0x1078];
		float  	m_flScrollSpeed; // 0x13bc
		int    	m_RopeFlags; // 0x13c0
		int    	m_iRopeMaterialModelIndex; // 0x13c4
		unsigned char _0x13c8[0x288];
		int    	m_nSegments; // 0x1650
		int    	m_hStartPoint; // 0x1654
		int    	m_hEndPoint; // 0x1658
		int    	m_iStartAttachment; // 0x165c
		int    	m_iEndAttachment; // 0x165e
		int    	m_iEndBone; // 0x1660
		int    	m_iStartBone; // 0x1662
		vector3	m_vecStartOffset; // 0x1664
		vector3	m_vecEndOffset; // 0x1670
		int    	m_Subdiv; // 0x167c
		int    	m_RopeLength; // 0x1680
		int    	m_Slack; // 0x1684
		float  	m_TextureScale; // 0x1688
		int    	m_fLockedPoints; // 0x168c
		float  	m_Width; // 0x1690
		unsigned char _0x1694[0x80];
		int    	m_bConstrainBetweenEndpoints; // 0x1714
	};
#pragma pack(pop)
