//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CSpriteTrail.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CSpriteTrail
	{
	public:
		unsigned char _0x0[0x201c];
		float  	m_flLifeTime; // 0x201c
		float  	m_flStartWidth; // 0x2020
		float  	m_flEndWidth; // 0x2024
		float  	m_flStartWidthVariance; // 0x2028
		float  	m_flTextureRes; // 0x202c
		float  	m_flMinFadeLength; // 0x2030
		vector3	m_vecSkyboxOrigin; // 0x2034
		float  	m_flSkyboxScale; // 0x2040
	};
#pragma pack(pop)
