//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CSteamJet.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CSteamJet
	{
	public:
		unsigned char _0x0[0x1474];
		float  	m_SpreadSpeed; // 0x1474
		float  	m_Speed; // 0x1478
		float  	m_StartSize; // 0x147c
		float  	m_EndSize; // 0x1480
		float  	m_Rate; // 0x1484
		float  	m_JetLength; // 0x1488
		int    	m_bEmit; // 0x148c
		int    	m_nType; // 0x1490
		int    	m_bFaceLeft; // 0x1494
		int    	m_spawnflags; // 0x1498
		float  	m_flRollSpeed; // 0x149c
	};
#pragma pack(pop)
