//***********************************************
// SDK Generated by ValveGen (written by Chod)
// File: CSun.h
//***********************************************

#pragma once


#pragma pack(push,1)
	class CSun
	{
	public:
		float  	HDRColorScale; // 0x0
		unsigned char _0x4[0x54];
		int    	m_clrRender; // 0x58
		unsigned char _0x5c[0x147c];
		int    	m_clrOverlay; // 0x14d8
		int    	m_nSize; // 0x14dc
		int    	m_nOverlaySize; // 0x14e0
		vector3	m_vDirection; // 0x14e4
		int    	m_bOn; // 0x14f0
		int    	m_nMaterial; // 0x14f4
		int    	m_nOverlayMaterial; // 0x14f8
	};
#pragma pack(pop)
